open hero graph
